/*
 * NTC.h
 *
 *  Created on: Mar 2, 2023
 *      Author: Вячеслав
 */

#ifndef INC_NTC_H_
#define INC_NTC_H_
/*Значение температуры при выходе за предел измерения*/
#define LowTemp 100
#define HighTemp 200
/*
 * Температура меняется в пределах от 0 до 50.
 * Таблица соответствия Температуры (от меньшей к большей) к коду АЦП
 * */
const uint16_t ADCval[]={
		3137,3099,3060,3021,2981,2940,2898,2856,2814,2771,2727,
		2683,2639,2594,2549,2504,2458,2412,2367,2321,2275,2229,
		2184,2138,2093,2048,2003,1958,1914,1742,1826,1783,1741,
		1699,1658,1616,1576,1536,1497,1459,1421,1384,1348,1312,
		1277,1242,1209,1176,1144,1112,1082
};
#endif /* INC_NTC_H_ */
